app/views/mentors/show.html.erb

  <b>Experiences:</b>
  <% @mentor.experiences.each do |e| %>
---
SELECT "experiences".* FROM "experiences" WHERE ("experiences".user_id = 1)