app/views/surveys/show.html.erb

<% form_for(@survey) do |f| %>
  <%=@survey.questions.count %>
---
SELECT "questions".* FROM "questions" WHERE ("questions".survey_id = 1)
SELECT COUNT(*) FROM "questions" WHERE ("questions".survey_id = 1)