app/views/availability_calendars/show.html.erb

SELECT "availability_days".* FROM "availability_days" WHERE ("availability_days".availability_calendar_id = 1)
---

  <% @availability_calendar.availability_days.find(:all, :order => 'availability_day').each do |day| %>