app/controllers/availability_days_controller.rb

  def index
    @availability_days = AvailabilityDay.all
---
SELECT "availability_days".* FROM "availability_days"

  def show
    @availability_day = AvailabilityDay.find(params[:id])
---
SELECT "availability_days".* FROM "availability_days" WHERE ("availability_days"."id" = 0) LIMIT 1