app/controllers/availability_calendars_controller.rb

  def index
    @availability_calendars = AvailabilityCalendar.all
---
SELECT "availability_calendars".* FROM "availability_calendars"

  def show
    @availability_calendar = AvailabilityCalendar.find(params[:id])
---
SELECT "availability_calendars".* FROM "availability_calendars" WHERE ("availability_calendars"."id" = 1) LIMIT 1

  def edit
	#if this user doesn't have calendar, create one and days for 21 days into future
    @availability_calendar = AvailabilityCalendar.find(params[:id])
---
SELECT "availability_calendars".* FROM "availability_calendars" WHERE ("availability_calendars"."id" = 1) LIMIT 1

  def update
    @availability_calendar = AvailabilityCalendar.find(params[:id])
---
SELECT "availability_calendars".* FROM "availability_calendars" WHERE ("availability_calendars"."id" = 1) LIMIT 1