app/controllers/experiences_controller.rb

SELECT "experiences".* FROM "experiences"
---
  def index
    @experiences = Experience.all

SELECT "experiences".* FROM "experiences" WHERE ("experiences"."id" = 1) LIMIT 1
---
  def show
    @experience = Experience.find(params[:id])

SELECT "experiences".* FROM "experiences" WHERE ("experiences"."id" = 1) LIMIT 1
---
  def edit
    @experience = Experience.find(params[:id])

INSERT INTO "experiences" ("updated_at", "ability", "created_at", "length_in_years", "comfort_level", "user_id") VALUES ('2011-02-15 02:23:51.806226', 'Objective-C', '2011-02-15 02:23:51.806226', 1, 3, NULL)
---
  def create
    @experience = Experience.new(params[:experience])

    respond_to do |format|
      if @experience.save

SELECT "experiences".* FROM "experiences" WHERE ("experiences"."id" = 1) LIMIT 1
---
  def update
    @experience = Experience.find(params[:id])

SELECT "experiences".* FROM "experiences" WHERE ("experiences"."id" = 2) LIMIT 1
DELETE FROM "experiences" WHERE ("experiences"."id" = 2)
---
  def destroy
    @experience = Experience.find(params[:id])
    @experience.destroy