app/controllers/mentorships_controller.rb

SELECT "mentorships".* FROM "mentorships"
---
  def index
    if session[:usertype] == :mentor
      @mentorships = Mentorship.where(:mentor_id => session[:id])
    elsif session[:usertype] == :mentee
      @mentorships = Mentorship.where(:mentee_id => session[:id])
    else
      @mentorships = Mentorship.all

SELECT "mentorships".* FROM "mentorships" WHERE ("mentorships"."id" = 1) LIMIT 1
---
  def show
    @mentorship = Mentorship.find(params[:id])

INSERT INTO "mentorships" ("mentee_id", "updated_at", "created_at", "mentor_id") VALUES (2, '2011-01-17 06:50:27.166185', '2011-01-17 06:50:27.166185', 1)
---
  def create
    @mentorship = Mentorship.new(params[:mentorship])

    respond_to do |format|
      if @mentorship.save