app/controllers/mentors_controller.rb

      @skills.each do |s|
        replacement = []
        s.each do |e|
          replacement = replacement + Mentor.where("id = ?", e.user_id)
---
SELECT "users".* FROM "users" WHERE ("users"."type" = 'Mentor')



    else
      @mentors = Mentor.all
---
SELECT "mentors".* FROM "mentors"

  def show
    # Mentors cannot view other mentors profiles
#    if (session[:usertype] == :mentor)
#      if (params[:id].to_s != session[:id].to_s)
#        redirect_to '/mentors', :notice => 'You cannot view the profiles of other mentors.'
#        return
#      end
#    end

    @mentor = Mentor.find(params[:id])
---
SELECT "mentors".* FROM "mentors" WHERE ("mentors"."id" = 1) LIMIT 1

  def edit
    if session[:id].to_s == params[:id].to_s
      @mentor = Mentor.find(params[:id])
---
SELECT "mentors".* FROM "mentors" WHERE ("mentors"."id" = 1) LIMIT 1

  def create
    @mentor = Mentor.new(params[:mentor])

    respond_to do |format|
      if @mentor.save

        @newuser = User.where(:id => @mentor.id).first
---
INSERT INTO "mentors" ("updated_at", "user_id", "created_at") VALUES ('2011-01-17 06:38:05.236583', 1, '2011-01-17 06:38:05.236583')
SELECT "users".* FROM "users" WHERE ("users"."id" = 6) LIMIT 1

  def update
    @mentor = Mentor.find(params[:id])
---
SELECT "mentors".* FROM "mentors" WHERE ("mentors"."id" = 1) LIMIT 1

  def destroy
    if session[:id].to_s == params[:id].to_s
      @mentor = Mentor.find(params[:id])

      #Delete Requests
      Request.where(:mentor_id => params[:id]).each do |r|
        r.destroy
---
SELECT "mentors".* FROM "mentors" WHERE ("mentors"."id" = 1) LIMIT 1
DELETE FROM "mentors" WHERE ("mentors"."id" = 1)

  def search
    @query = params[:q]
    queryWords = @query.split
    @mentors =[]

    queryWords.each do |q|
      skills = Skill.where("title LIKE :query",{:query => "%#{q}%"})
      skills.each do |e|
        @mentors = @mentors | Mentor.where("id = ?",e.user_id)
---
SELECT "users".* FROM "users" WHERE ("users"."type" = 'Mentor') AND (name LIKEY '%Mentor%' OR name LIKEY '%n%' )