app/controllers/mentees_controller.rb

SELECT "users".* FROM "users" WHERE ("users".accountable_id = 1 AND "users".accountable_type = 'Mentee') LIMIT 1
---
      @skills.each do |s|
        replacement = []
        s.each do |e|
          replacement = replacement + Mentee.where("id = ?", e.user_id)

SELECT "mentees".* FROM "mentees"
---


    else
      @mentees = Mentee.all

SELECT "mentees".* FROM "mentees" WHERE ("mentees"."id" = 1) LIMIT 1
---
  def show
    # Mentees cannot view other mentees profiles
    if (session[:usertype] == :mentee)
      if (params[:id].to_s != session[:id].to_s)
        redirect_to '/mentees', :notice => 'You cannot view the profiles of other mentees.'
        return
      end
    end

    @mentee = Mentee.find(params[:id])

INSERT INTO "mentees" ("user_id", "updated_at", "created_at") VALUES (2, '2011-01-17 06:43:11.661520', '2011-01-17 06:43:11.661520')
SELECT "users".* FROM "users" WHERE ("users"."id" = 10) LIMIT 1
---
  def create
    @mentee = Mentee.new(params[:mentee])

    respond_to do |format|
      if @mentee.save

        @newuser = User.where(:id => @mentee.id).first

SELECT "mentees".* FROM "mentees" WHERE ("mentees"."id" = 4) LIMIT 1
---
  def destroy
    if session[:id].to_s == params[:id].to_s
      @mentee = Mentee.find(params[:id])

DELETE FROM "mentees" WHERE ("mentees"."id" = 4)
---
#        s.destroy
#      end

      @mentee.destroy