app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests"
---
  def index
    if session[:usertype] == :mentor
      @requests = Request.where(:mentor_id => session[:id])
    elsif session[:usertype] == :mentee
      @requests = Request.where(:mentee_id => session[:id])
    else
      @requests = Request.all

SELECT "requests".* FROM "requests" WHERE ("requests"."id" = 1) LIMIT 1
---
  def show
    @request = Request.find(params[:id])

INSERT INTO "requests" ("reason", "mentor_id", "updated_at", "mentee_id", "created_at", "estimated_length") VALUES ('I need radical guitar skills', 5, '2011-02-15 03:20:10.604731', NULL, '2011-02-15 03:20:10.604731', '1 year')
UPDATE "requests" SET "mentee_id" = 2, "updated_at" = '2011-01-27 04:20:49.167167' WHERE ("requests"."id" = 5)
---
  def create
    @request = Request.new(params[:request])
    @request.mentor = Mentor.find(params[:mentor_id])
    @request.mentee = Mentee.find(session[:id])
    @mentor = @request.mentor

    if @request.save

SELECT "requests".* FROM "requests" WHERE ("requests"."id" = 5) LIMIT 1
INSERT INTO "mentorships" ("updated_at", "mentor_id", "created_at", "mentee_id") VALUES ('2011-01-28 15:58:09.294542', 1, '2011-01-28 15:58:09.294542', 2)
DELETE FROM "requests" WHERE ("requests"."id" = 7)
---
  def update
    @mentorship = Mentorship.new
    @request = Request.find(params[:id])
    @mentorship.mentor = @request.mentor
    @mentorship.mentee = @request.mentee

    if @mentorship.save
      Notifier.mentorship_accepted_email(@request).deliver
      redirect_to(@mentorship.mentee, :notice => "Meet your new mentee!")
      @request.destroy