app/controllers/responses_controller.rb

SELECT "responses".* FROM "responses"
---
  def index
    @responses = Response.all

SELECT "responses".* FROM "responses" WHERE ("responses"."id" = 1) LIMIT 1
---
  def show
    @response = Response.find(params[:id])

INSERT INTO "responses" ("updated_at", "question_id", "response_text", "created_at") VALUES ('2011-02-16 02:21:02.066342', NULL, 'not very well', '2011-02-16 02:21:02.066342')
---
  def create
    @response = Response.new(params[:response])

   respond_to do |format|
      if @response.save

SELECT "responses".* FROM "responses" WHERE ("responses"."id" = 1) LIMIT 1
DELETE FROM "responses" WHERE ("responses"."id" = 1)
---
  def destroy
    @response = Response.find(params[:id])
    @response.destroy