app/controllers/surveys_controller.rb

SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 0) LIMIT 1
---
  def show
    @survey = Survey.find(params[:id])

INSERT INTO "surveys" ("created_at", "description", "updated_at") VALUES ('2011-01-17 06:52:03.177265', 'Effectiveness Estimation', '2011-01-17 06:52:03.177265')
---
  def create
    @survey = Survey.new(params[:survey])

    respond_to do |format|
      if @survey.save

SELECT "surveys".* FROM "surveys" WHERE ("surveys"."id" = 1) LIMIT 1
DELETE FROM "surveys" WHERE ("surveys"."id" = 1)
---
  def destroy
    @survey = Survey.find(params[:id])
    @survey.destroy