app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("accountable_id", "password", "name", "interests", "school", "major", "updated_at", "created_at", "total_years_experience", "current_position", "location", "phone", "accountable_type", "email") VALUES (NULL, 'pianoman', 'Darren Haffner', 'Billy Joel, The Beatles, Fleet Foxes', 'Rose-Hulman Institute of Technology', 'Software Engineering', '2011-01-17 06:14:21.959004', '2011-01-17 06:14:21.959004', 5, 'Student', 'Terre Haute, IN', 8125555555, NULL, 'haffnedm@rose-hulman.edu')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1
UPDATE "users" SET "updated_at" = '2011-01-17 06:24:02.498976', "total_years_experience" = 26 WHERE ("users"."id" = 2)

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 4) LIMIT 1
DELETE FROM "users" WHERE ("users"."id" = 4)